package com.lab3.data

import com.lab3.R

object ItemsData {
    val itemsList = listOf(
        Item(
            1,
            "Ейфелева вежа",
            "Символ Парижа і Франції, архітектурна ікона висотою 330 метрів, побудована у 1889 році.",
            "Символ Парижа і Франції, спроєктований інженером Густавом Ейфелем, був відкритий у 1889 році до Всесвітньої виставки. Ця металева конструкція висотою 330 метрів є одним із найбільш відвідуваних місць світу. Вежа має три рівні, на яких розташовані ресторани, оглядові майданчики і навіть музей, звідки відкриваються захоплюючі краєвиди на Париж.",
            image= R.drawable.eifel
        ),
        Item(
            2,
            "Лувр",
            "Найбільший музей світу, відомий колекцією мистецтва, включаючи \"Мона Лізу\".",
            "Колишній королівський палац, нині найбільший музей у світі, розташований у центрі Парижа на правому березі Сени. Його колекція налічує понад 35 000 творів мистецтва, що охоплюють періоди від давнини до 19 століття. Серед найвідоміших експонатів — \"Мона Ліза\" Леонардо да Вінчі, \"Венера Мілоська\" і \"Крилата перемога Самофракії\". Архітектурною окрасою музею є сучасна скляна піраміда у внутрішньому дворі.",
            R.drawable.louvre
        ),
        Item(
            3,
            "Версальський палац",
            "Королівська резиденція з розкішними садами, символ французької монархії.\n",
            "Один із найвеличніших королівських палаців світу, побудований у 17 столітті за наказом Людовика XIV, \"Короля-Сонця\". Палац вражає своєю архітектурою, позолоченими інтер’єрами і Дзеркальною галереєю, де відбувалися важливі історичні події. Палац оточений розкішними садами зі скульптурами, фонтанами і геометрично спланованими алеями, які щороку відвідують мільйони туристів.",
            R.drawable.versel
        ),
        Item(
            4,
            "Мон-Сен-Мішель",
            "Острів-фортеця з середньовічним абатством, що піднімається над Атлантикою.",
            "Унікальний острів-фортеця в Нормандії, що піднімається посеред затоки. На його вершині розташоване середньовічне абатство, побудоване у 8 столітті. Мон-Сен-Мішель відомий своїм неповторним виглядом, який змінюється залежно від припливів і відпливів. Це місце є об'єктом Світової спадщини ЮНЕСКО і приваблює туристів своїми вузькими вуличками, сувенірними крамничками та мальовничими краєвидами.",
             R.drawable.palce
        ),
        Item(
            5,
            "Прованс",
            "Регіон з лавандовими полями, історичними містами і мальовничими краєвидами.",
            "Регіон на південному сході Франції, відомий своїми лавандовими полями, старовинними містами і середземноморським кліматом. Прованс — це також історичний центр римської культури, де можна побачити амфітеатри, акведуки і храми. Найбільші принади регіону включають мальовничі села, такі як Горд і Руссільйон, а також міста Арль, Авіньйон і Екс-ан-Прованс, кожне з яких має багату історію та архітектурні шедеври.",
             R.drawable.provence
        )
    )
}

class Item(val id: Int, val name: String, val title: String, val description: String, val image: Int)
